# Creating dataframe for recommender output

- Again, json files were not uploaded, but all came from the Goodreads dataset.
- Books and authors dataframes were merged to create a final dataframe with
     - Book Id
     - Book Title
     - Author name
     - Year Published
- This file was used for the output for the streamlit app.

In [2]:
import pandas as pd

In [3]:
books = pd.read_json('../data/goodreads_books_children.json', lines=True)

In [4]:
authors = pd.read_json('../data/goodreads_book_authors.json', lines=True)

In [5]:
books.head(2)

,isbn,text_reviews_count,series,country_code,language_code,popular_shelves,asin,is_ebook,average_rating,kindle_asin,...,publication_month,edition_information,publication_year,url,image_url,book_id,ratings_count,work_id,title,title_without_series
0,1599150603,7,[],US,,"[{'count': '56', 'name': 'to-read'}, {'count':...",,false,4.13,B00DU10PUG,...,9,,2006,https://www.goodreads.com/book/show/287141.The...,https://s.gr-assets.com/assets/nophoto/book/11...,287141,46,278578,The Aeneid for Boys and Girls,The Aeneid for Boys and Girls
1,1934876569,6,[151854],US,,"[{'count': '515', 'name': 'to-read'}, {'count'...",,false,4.22,,...,3,,2009,https://www.goodreads.com/book/show/6066812-al...,https://images.gr-assets.com/books/1316637798m...,6066812,98,701117,All's Fairy in Love and War (Avalon: Web of Ma...,All's Fairy in Love and War (Avalon: Web of Ma...

In [5]:
authors.head(2)

,average_rating,author_id,text_reviews_count,name,ratings_count
0,3.98,604031,7,Ronald J. Fields,49
1,4.08,626222,28716,Anita Diamant,546796

In [7]:
# Just using 3 columns from books

books_2 = books[['book_id', 'authors', 'publication_year']]

In [8]:
books_2.head(2)

   book_id                                 authors publication_year
0   287141  [{'author_id': '3041852', 'role': ''}]             2006
1  6066812    [{'author_id': '19158', 'role': ''}]             2009

In [9]:
books_2['authors'][0][0]['author_id'] #author_id is a string

'3041852'

In [10]:
# Getting actual author id from the "authors" column

id_list_master=[]
for entry in books_2['authors']:
    author_id_list=[]
    for person in entry:
        if person['role'] == '':
            author_id_list.append(person['author_id'])
    
    id_list_master.append(author_id_list)

In [11]:
books_2['author_id_list'] = id_list_master

<ipython-input-11-4836bbae8d27>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  books_2['author_id_list'] = id_list_master

In [12]:
books_2.head(2)

,book_id,authors,publication_year,author_id_list
0,287141,"[{'author_id': '3041852', 'role': ''}]",2006,[3041852]
1,6066812,"[{'author_id': '19158', 'role': ''}]",2009,[19158]

In [13]:
authors.head(2)

,average_rating,author_id,text_reviews_count,name,ratings_count
0,3.98,604031,7,Ronald J. Fields,49
1,4.08,626222,28716,Anita Diamant,546796

In [14]:
authors[authors['author_id'] == 0] #Check if 0 is an author id

Empty DataFrame
Columns: [average_rating, author_id, text_reviews_count, name, ratings_count]
Index: []

In [15]:
author_list=[]
for entry in books_2['author_id_list']:
    if len(entry) >= 1:
        author_list.append(entry[0])
    elif len(entry) == 0:
        author_list.append(0)

In [16]:
books_2['author_id'] = author_list

<ipython-input-16-759956af5a6e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  books_2['author_id'] = author_list

In [17]:
books_2.tail(10)

,book_id,authors,publication_year,author_id_list,author_id
124072,4462101,"[{'author_id': '158837', 'role': ''}, {'author...",,[158837],158837
124073,25332059,"[{'author_id': '6863370', 'role': ''}, {'autho...",2016,[6863370],6863370
124074,23346344,"[{'author_id': '7336859', 'role': ''}]",2015,[7336859],7336859
124075,30164426,"[{'author_id': '13663', 'role': ''}]",2013,[13663],13663
124076,823094,"[{'author_id': '44955', 'role': ''}, {'author_...",2000,[44955],44955
124077,24558598,"[{'author_id': '421368', 'role': ''}]",,[421368],421368
124078,13057172,"[{'author_id': '313653', 'role': ''}]",2011,[313653],313653
124079,7925060,"[{'author_id': '1221698', 'role': ''}, {'autho...",2010,[1221698],1221698
124080,331839,"[{'author_id': '10681', 'role': ''}, {'author_...",2002,[10681],10681
124081,2342551,"[{'author_id': '82312', 'role': 'Editor'}]",1996,[],0

In [18]:
books_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 124082 entries, 0 to 124081
Data columns (total 5 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   book_id           124082 non-null  int64
 1   authors           124082 non-null  object
 2   publication_year  124082 non-null  object
 3   author_id_list    124082 non-null  object
 4   author_id         124082 non-null  object
dtypes: int64(1), object(4)
memory usage: 4.7+ MB

In [19]:
books_2['author_id'] = books_2['author_id'].astype(int)

<ipython-input-19-65b8fcb802e5>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  books_2['author_id'] = books_2['author_id'].astype(int)

In [20]:
authors.columns

Index(['average_rating', 'author_id', 'text_reviews_count', 'name',
       'ratings_count'],
      dtype='object')

In [21]:
authors.drop(columns=['average_rating', 'text_reviews_count', 'ratings_count'], inplace=True)

In [22]:
df_merged = pd.merge(left = books_2, right=authors, how='left', on = 'author_id')

In [23]:
df_merged.head(2)

,book_id,authors,publication_year,author_id_list,author_id,name
0,287141,"[{'author_id': '3041852', 'role': ''}]",2006,[3041852],3041852,Alfred J. Church
1,6066812,"[{'author_id': '19158', 'role': ''}]",2009,[19158],19158,Rachel Roberts

In [24]:
books.shape

(124082, 29)

In [25]:
books_2.shape

(124082, 5)

In [26]:
df_merged.shape

(124082, 6)

In [30]:
df_merged[df_merged['author_id'] == 0].shape # There are 3_427 books without listed authors

(3427, 6)

In [31]:
df_final = df_merged[['book_id', 'name', 'publication_year']]

In [32]:
df_final.head(2)

   book_id              name publication_year
0   287141  Alfred J. Church             2006
1  6066812    Rachel Roberts             2009

In [33]:
df_final.isna().sum()

book_id                0
name                3427
publication_year       0
dtype: int64

In [34]:
sample = pd.read_csv('../data/books_reviews_sample.csv')

In [35]:
sample.head(2)

,book_id,title,user_id,rating
0,5,Harry Potter and the Prisoner of Azkaban (Harr...,84f866eb6dae54d7ac52d45a4c9b4d1f,4
1,5,Harry Potter and the Prisoner of Azkaban (Harr...,f1b86bf7c103c46fcb854e1fb711b1ec,5

In [36]:
len(sample['book_id'].unique())

3512

In [37]:
df_all = pd.merge(left = sample, right=df_final, how='left', on = 'book_id')

In [38]:
df_all.head(3)

,book_id,title,user_id,rating,name,publication_year
0,5,Harry Potter and the Prisoner of Azkaban (Harr...,84f866eb6dae54d7ac52d45a4c9b4d1f,4,J.K. Rowling,2004
1,5,Harry Potter and the Prisoner of Azkaban (Harr...,f1b86bf7c103c46fcb854e1fb711b1ec,5,J.K. Rowling,2004
2,5,Harry Potter and the Prisoner of Azkaban (Harr...,832c59bc39f8c9a2bc79459ae302b517,5,J.K. Rowling,2004

In [39]:
df_all.isna().sum()

book_id                0
title                  0
user_id                0
rating                 0
name                1458
publication_year       0
dtype: int64

In [40]:
df_all.fillna("No listed author", inplace=True)

In [41]:
df_all.isna().sum()

book_id             0
title               0
user_id             0
rating              0
name                0
publication_year    0
dtype: int64

In [42]:
df_all.drop_duplicates(subset='book_id', keep='first', inplace=True)

In [43]:
df_all.shape

(3512, 6)

In [44]:
df_all.head()

,book_id,title,user_id,rating,name,publication_year
0,5,Harry Potter and the Prisoner of Azkaban (Harr...,84f866eb6dae54d7ac52d45a4c9b4d1f,4,J.K. Rowling,2004
665,330,On Beyond Zebra!,9d7e29b65221644283573d46a1ef6762,5,Dr. Seuss,1955
682,903,"The Egypt Game (Game, #1)",6adb9b5f52e7a89b820d8afcb6329b0e,3,Zilpha Keatley Snyder,2009
754,1167,Junie B. Jones and a Little Monkey Business (J...,fae00b7cd9833d9ffbce8957d612266c,3,Barbara Park,
795,3562,"Emily of New Moon (Emily, #1)",3a7c10ce7f1204c5806640f838c59892,5,L.M. Montgomery,1983

In [45]:
df_all.drop(columns=['user_id', 'rating'], inplace=True)

In [46]:
df_all

,book_id,title,name,publication_year
0,5,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling,2004
665,330,On Beyond Zebra!,Dr. Seuss,1955
682,903,"The Egypt Game (Game, #1)",Zilpha Keatley Snyder,2009
754,1167,Junie B. Jones and a Little Monkey Business (J...,Barbara Park,
795,3562,"Emily of New Moon (Emily, #1)",L.M. Montgomery,1983
...,...,...,...,...
91503,35072624,The Call of the Swamp,Davide Cali,2017
91515,35072626,When a Wolf Is Hungry,Christine Naumann-Villemin,2017
91530,35669801,The Little Red Wolf,No listed author,2017
91543,35830942,Oh Susannah: Things That Go Bump: An Oh Susann...,Carole P. Roman,
91554,36069855,Fish-Boy,Vanita Oelschlager,2018

In [47]:
df_all.rename(columns={'title': 'Title', 'name': 'Author', 'publication_year': 'Publication Year'}, inplace=True)

In [49]:
df_all.head()

,book_id,Title,Author,Publication Year
0,5,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling,2004
665,330,On Beyond Zebra!,Dr. Seuss,1955
682,903,"The Egypt Game (Game, #1)",Zilpha Keatley Snyder,2009
754,1167,Junie B. Jones and a Little Monkey Business (J...,Barbara Park,
795,3562,"Emily of New Moon (Emily, #1)",L.M. Montgomery,1983

In [50]:
df_all.isna().sum()

book_id             0
Title               0
Author              0
Publication Year    0
dtype: int64

In [51]:
df_all['Publication Year'].value_counts()

        376
2014    320
2016    298
2013    298
2015    282
       ...
1980      1
1965      1
1956      1
1923      1
1940      1
Name: Publication Year, Length: 69, dtype: int64

In [53]:
#df_all.to_csv('../data/books_info.csv', index=False)

In [59]:
book_info = pd.read_csv('books_info.csv', index_col=None, 
                     usecols=['book_id', 'Title', 'Author', 'Publication Year'], 
                     dtype = {'Publication Year': 'object'})

In [60]:
book_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3512 entries, 0 to 3511
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           3512 non-null   int64
 1   Title             3512 non-null   object
 2   Author            3512 non-null   object
 3   Publication Year  3136 non-null   object
dtypes: int64(1), object(3)
memory usage: 109.9+ KB

In [63]:
book_info.fillna("No year listed", inplace=True)

In [64]:
#book_info.to_csv('../data/books_info.csv', index=False)